yi-pian/TI_InvitationTournament/MSPM0_Signal_Contest/10_tests/algorithm_backend_benchmark/target_ticlang/iqmath_mathacl_smoke.syscfg
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

const MATHACL = scripting.addModule("/ti/driverlib/MATHACL");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL", {}, false);

ProjectConfig.genLibIQ = true;
ProjectConfig.genLibIQVersion = "MATHACL";
